In [1]:
from sqlalchemy import create_engine, text
engine = create_engine("mysql+mysqlconnector://root:abc@127.0.0.1:3306/cs544")
conn = engine.connect()

In [ ]:
list(conn.execute(text("show tables;")))

In [ ]:
# table: users
# columns: id, name, phone
# name is required
# id uniquely identifies row
conn.execute(text("""
    CREATE TABLE users (id INT, name TEXT NOT NULL, phone TEXT, PRIMARY KEY(id))
"""))

In [ ]:
# Needed to drop table so we could fix the constraint on name being not null
# conn.execute(text("drop table users;"))

In [6]:
# Inserting rows into the table
# Format: INSERT INTO table (columns) VALUES (values to put in each column)

conn.execute(text("""
    INSERT INTO users (id, name) VALUES (1, "tyler")
"""))

# Note: if we run this command twice, we get an error because we can't have duplicate primary keys

In [ ]:
# Create an accounts table with a foreign key to the users table
conn.execute(text("""
    CREATE TABLE accounts (user_id INT, name text NOT NULL, amount INT NOT NULL, FOREIGN KEY (user_id) references users(id))
"""))

In [ ]:
# This gives error, we can't insert a row in accounts that references a non-existent row in users (violates foreign key constraint)
# conn.execute(text("""
#     INSERT INTO accounts (user_id, name, amount) VALUES (2, "A", 10)
# """))

In [ ]:
# We can have 2 bank accounts for the same user:
conn.execute(text("""
    INSERT INTO accounts (user_id, name, amount) VALUES (1, "A", 10);
"""))

In [ ]:
# We can have 2 bank accounts for the same user:
conn.execute(text("""
    INSERT INTO accounts (user_id, name, amount) VALUES (1, "B", 100);
"""))

In [ ]:
# Make the recent changes durable
conn.commit()

In [8]:
# Check the contents of our table so far:
list(conn.execute(text("""
    SELECT * FROM accounts;
""")))

[(1, 'A', 10), (1, 'B', 100)]

In [ ]:
# This gives an error, as it would cause a foreign key constraint:
# conn.execute(text("""
#     DELETE FROM users WHERE id = 1;
# """))

# Load CSVs to MySQL tables

In [ ]:
# creates 3 tables, "actions", "loan types", and "purposes"
import pandas as pd
url = "https://raw.githubusercontent.com/cfpb/api/master/resources/datasets/hmda/code_sheets/"
df = pd.read_csv(url + "action_taken.csv")
df.to_sql("actions", conn, index=False, if_exists="replace")    # df.to_sql([table name], [db connection], [index=do we want row num as a column in the table?], [if_exists=do we want to overwrite?])
df = pd.read_csv(url + "loan_type.csv")
df.to_sql("loan_types", conn, index=False, if_exists="replace")
df = pd.read_csv(url + "loan_purpose.csv")
df.to_sql("purposes", conn, index=False, if_exists="replace")
conn.commit()

In [9]:
# check that the tables were created successfully
list(conn.execute(text("show tables;")))

[('accounts',),
 ('actions',),
 ('loan_types',),
 ('loans',),
 ('purposes',),
 ('users',)]

In [ ]:
import pyarrow as pa
import pyarrow.csv, pyarrow.parquet
# use PyArrow to do type inference (must be done before making a SQL table) and then write as Parquet file (10x smaller than the CSV file due to compression)
pa.parquet.write_table(pa.csv.read_csv("hdma-wi-2021.csv"), "loans.parquet")
# because our Parquet file is column-oriented, grabbing a subset of columns is much faster than operating with a CSV --> put into a PyArrow table
t = pa.parquet.read_table("loans.parquet", columns=["lei", "action_taken", "loan_type", "loan_amount", "interest_rate", "loan_purpose", "income"])

# TODO: to_sql with chunking

In [10]:
!ls -lah

total 204M
drwxrwxr-x 4 dsmith7789 dsmith7789 4.0K Oct 15 01:23 .
drwxrwxr-x 6 dsmith7789 dsmith7789 4.0K Oct 14 22:54 ..
drwxrwxr-x 2 dsmith7789 dsmith7789 4.0K Oct 14 22:54 .ipynb_checkpoints
-rw-rw-r-- 1 dsmith7789 dsmith7789  482 Oct 14 06:13 Dockerfile
-rw-rw-r-- 1 dsmith7789 dsmith7789 9.9K Oct 15 01:23 SQL1.ipynb
-rw-r----- 1 dsmith7789 dsmith7789 167M Nov  1  2022 hdma-wi-2021.csv
-rw-rw-r-- 1 dsmith7789 dsmith7789  21M Jan  5  2023 hdma-wi-2021.zip
-rw-rw-r-- 1 dsmith7789 dsmith7789  16M Oct 14 23:52 loans.parquet
drwxr-xr-x 3 root       root       4.0K Oct 14 06:28 nb

In [ ]:
t

In [ ]:
# now we put the PyArrow table into SQL (need to convert to Pandas because no direct PyArrow.to_sql function)
# load in chunks otherwise we'll run out of memory (this table will have ~400k rows)
t.to_pandas().to_sql("loans", conn, index=False, if_exists="replace", chunksize=10000)
conn.commit()

In [ ]:
# we can use Pandas for SQL queries, gives a nicer output
pd.read_sql("""
    SELECT * FROM accounts
""", conn)   # don't forget to specify the connection!

In [12]:
# take $4 out of account A
conn.execute(text("""
    UPDATE accounts SET amount = amount - 4 WHERE name = 'A';
"""))

In [13]:
# and transfer the $4 to account B
conn.execute(text("""
    UPDATE accounts SET amount = amount + 4 WHERE name = 'B';
"""))

In [16]:
# check the table now
pd.read_sql("""
    SELECT * FROM accounts
""", conn)

   user_id name  amount
0        1    A       6
1        1    B     104

# But, the table is not updated in the other DB connection (in our terminal)!

#### This is because our intermediate progress is isolated from other connections until we commit the transaction.

In [18]:
remaining = list(conn.execute(text("""
    SELECT amount FROM accounts WHERE name = 'A';
""")))[0][0]    # pull the value out of the list(tuple) result
if remaining > 0:
    print("It worked!")
    conn.commit()    # at this point, the updated funds will show in the query results of all connections
else:
    print("Not enough funds.")
    conn.rollback()

It worked!

# Let's combine the above steps:

In [20]:
# take $4 out of account A
conn.execute(text("""
    UPDATE accounts SET amount = amount - 4 WHERE name = 'A';
"""))

# and transfer the $4 to account B
conn.execute(text("""
    UPDATE accounts SET amount = amount + 4 WHERE name = 'B';
"""))

remaining = list(conn.execute(text("""
    SELECT amount FROM accounts WHERE name = 'A';
""")))[0][0]    # pull the value out of the list(tuple) result
if remaining > 0:
    print("It worked!")
    conn.commit()    # at this point, the updated funds will show in the query results of all connections
else:
    print("Not enough funds.")
    conn.rollback()

# check the table now
pd.read_sql("""
    SELECT * FROM accounts
""", conn)

Not enough funds.

   user_id name  amount
0        1    A       2
1        1    B     108

# Query practice (loans example)

## 1. what are the first 10 loans?  Practice LIMIT.

In [3]:
import pandas as pd
pd.read_sql("""
    SELECT * FROM loans LIMIT 10;
""", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,54930034MNPILHP25H80,6,1,305000.0,3.875,1,108.0
1,54930034MNPILHP25H80,4,1,65000.0,NA,1,103.0
2,54930034MNPILHP25H80,6,1,75000.0,3.25,1,146.0
3,54930034MNPILHP25H80,1,1,155000.0,4.0,32,70.0
4,54930034MNPILHP25H80,1,1,305000.0,3.25,1,71.0
5,54930034MNPILHP25H80,1,1,175000.0,3.375,1,117.0
6,54930034MNPILHP25H80,1,1,575000.0,4.5,1,180.0
7,54930034MNPILHP25H80,1,1,105000.0,5.375,1,180.0
8,54930034MNPILHP25H80,1,1,85000.0,3.375,1,136.0
9,549300FQ2SN6TRRGB032,1,1,405000.0,Exempt,1,NaN

## 2. what are the first 10 interest rates and loan amounts (in thousands)?  Practice SELECT.

In [4]:
pd.read_sql("""
    SELECT 
        interest_rate
        , loan_amount / 1000 as "loan amount (in thousands)"
    FROM 
        loans 
    LIMIT 
        10;
""", conn)

  interest_rate  loan amount (in thousands)
0         3.875                       305.0
1            NA                        65.0
2          3.25                        75.0
3           4.0                       155.0
4          3.25                       305.0
5         3.375                       175.0
6           4.5                       575.0
7         5.375                       105.0
8         3.375                        85.0
9        Exempt                       405.0

## 3. what are the loans for individuals with income over $1 million?  Practice WHERE.

In [6]:
pd.read_sql("""
    SELECT 
       *
    FROM 
        loans 
    WHERE
        income > 1000000
""", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,254900IER2H3R8YLBW04,1,1,105000.0,2.875,31,1530000.0
1,3Y4U8VZURTYWI1W2K376,3,1,7455000.0,NA,4,94657029.0
2,549300CS1XP28EERR469,1,1,75000.0,4.99,4,2030000.0
3,549300CS1XP28EERR469,1,1,205000.0,3.75,1,7291000.0

## 4. what are the five biggest loans in terms of dollar amount?  Practice ORDER BY.

In [8]:
pd.read_sql("""
    SELECT 
       *
    FROM 
        loans 
    ORDER BY
        loan_amount DESC
    LIMIT
        5;
""", conn)

,lei,action_taken,loan_type,loan_amount,interest_rate,loan_purpose,income
0,549300XWUSRVVOHPRY47,6,1,264185000.0,NA,1,None
1,AD6GFRVSDT01YPT1CS68,1,1,74755000.0,1.454,1,None
2,AD6GFRVSDT01YPT1CS68,4,2,66005000.0,NA,1,None
3,YQI2CPR3Z44KAR0HG822,1,1,65005000.0,3.0,1,None
4,254900YA1AQXNM8QVZ06,1,2,63735000.0,2.99,2,None

## 5. what are the actions taken and types for those loans (show the text, not numbers)?  Practice INNER JOIN.

In [39]:
pd.read_sql("""
    SELECT 
       l.lei
       , l.loan_amount / 1000 as "loan amt (thousands)"
       , lt.loan_type
       , a.action_taken
    FROM 
        loans l
        INNER JOIN actions a ON l.action_taken = a.id
        INNER JOIN loan_types lt ON l.loan_type = lt.id
    ORDER BY
        l.loan_amount DESC
    LIMIT
        5;
""", conn)

,lei,loan amt (thousands),loan_type,action_taken
0,549300XWUSRVVOHPRY47,264185.0,Conventional,Loan purchased by the institution
1,AD6GFRVSDT01YPT1CS68,74755.0,Conventional,Loan originated
2,AD6GFRVSDT01YPT1CS68,66005.0,FHA-insured,Application withdrawn by applicant
3,YQI2CPR3Z44KAR0HG822,65005.0,Conventional,Loan originated
4,254900YA1AQXNM8QVZ06,63735.0,FHA-insured,Loan originated

## 6. what is a loan_purpose that doesn't appear in the loans table?  Practice LEFT/RIGHT JOIN.

In [41]:
pd.read_sql("""
    SELECT 
        p.id
        , p.loan_purpose
    FROM 
        purposes p
        LEFT JOIN loans l on l.loan_purpose = p.id
    WHERE
        l.loan_purpose IS NULL;
""", conn)

   id loan_purpose
0   3  Refinancing

## 7. how many rows are in the table?  Practice COUNT(*).

In [17]:
pd.read_sql("""
    SELECT 
       COUNT(*)
    FROM 
        loans;
""", conn)

   COUNT(*)
0    447367

## 8. how many non-null values are in the income column?  Practice COUNT(column).

In [4]:
import pandas as pd
pd.read_sql("""
    SELECT 
       COUNT(income) as "income not null"
    FROM 
        loans
    WHERE
        income is not NULL;
""", conn)

   income not null
0           399948

## 9. what is the average interest rate for loans of type "Conventional"?  Practice AVG.

In [20]:
pd.read_sql("""
    SELECT 
       AVG(l.interest_rate) as "Avg Conventional Loan Interest Rate"
    FROM 
        loans l
        INNER JOIN loan_types lt on l.loan_type = lt.id
    WHERE
        lt.loan_type = 'Conventional';
""", conn)

   Avg Conventional Loan Interest Rate
0                              2.21657

## 10. how many loans are there of each type?  Practice GROUP BY.

In [5]:
pd.read_sql("""
    SELECT 
       lt.loan_type as "Loan Type"
       , COUNT(*) as "Amount"
    FROM 
        loans l
        INNER JOIN loan_types lt on l.loan_type = lt.id
    GROUP BY
        lt.loan_type;
""", conn)

            Loan Type  Amount
0        Conventional  389217
1       VA-guaranteed   24551
2         FHA-insured   30496
3  FSA/RHS-guaranteed    3103

## 11. which loan types appear at least 10,000 times?  Practice HAVING.

In [6]:
pd.read_sql("""
    SELECT 
       lt.loan_type as "Loan Type"
       , COUNT(lt.loan_type) as "Amount"
    FROM 
        loans l
        INNER JOIN loan_types lt on l.loan_type = lt.id
    GROUP BY
        lt.loan_type
    HAVING
        COUNT(lt.loan_type) >= 10000;
""", conn)

       Loan Type  Amount
0   Conventional  389217
1  VA-guaranteed   24551
2    FHA-insured   30496

## 12.  how many loans are between $10K and 20K?  Practice BETWEEN.

In [29]:
pd.read_sql("""
    SELECT 
       COUNT(*) as "Number of Loans between 10k and 20k"
    FROM 
        loans
    WHERE
        loan_amount BETWEEN 10000 AND 20000;
""", conn)

   Number of Loans between 10k and 20k
0                                 5984

## 13. how fast is the above query with and without a BTREE index?  Practice indexing.